{"question": "Mary is baking a cake. The recipe calls for 12 cups of sugar and 14 cups of flour. She already put in 10 cups of sugar. How many more cups of flour than cups of sugar does she need to add now?", "program": "”\ncups_of_sugar_needed = 12\ncups_of_sugar_added = 10\ncups_of_flour_needed = 14\n# Follow up: how many more cups of flour than cups of sugar does she need to add now?\ncups_of_flour_to_add = cups_of_flour_needed - (cups_of_sugar_needed - cups_of_sugar_added)\nans= cups_of_flour_to_add", "gold_ans": "12", "Ans": 2.0}
{"question": "Baker made 13 cakes. He sold 91 of them and bought 154 new cakes. How many more cakes did baker buy than those he sold?", "program": "cakes_made = 13\ncakes_sold = 91\ncakes_bought = 154\n# Follow up: how many cakes did baker buy?\ncakes_bought_total = cakes_made + cakes_sold + cakes_bought\n# Follow up: how many more cakes did baker buy than those he sold?\ncakes_bought_difference = cakes_bought_total - cakes_sold\nans = cakes_bought_difference", "gold_ans": "63", "Ans": 154.0}
{"question": "The ring toss game at the carnival made the same amount of money each day. In total in 30 days they earned 420 dollars. Together with game they earned 22 dollars. How much did ring toss game make per day?", "program": "total_money_earned = 420\nmoney_earned_from_game = 22\ntotal_days = 30\n# Follow up: How much did ring toss game make per day?\nmoney_earned_from_ring_toss = total_money_earned - money_earned_from_game\nring_toss_per_day = money_earned_from_ring_toss / total_days\nans = ring_toss_per_day", "gold_ans": "14", "Ans": 13.266666666666667}
{"question": "After eating a hearty meal they went to see the Buckingham palace. There, Rachel learned that 512 visitors came to the Buckingham palace that day. If there were 471 visitors the previous day and 808 visitors the day before that How many visited the Buckingham palace within the past 89 days?", "program": "visitors_today = 512\nvisitors_previous_day = 471\nvisitors_day_before = 808\n# Follow up: how many visitors visited the Buckingham palace within the past 89 days?\ntotal_visitors_in_89_days = visitors_today + visitors_previous_day + visitors_day_before\nans = total_visitors_in_89_days", "gold_ans": "1791", "Ans": 71279.0}
{"question": "An industrial machine can make 6 shirts a minute. It worked for 5 minutes yesterday and for 12 minutes today. How many shirts did machine make today?", "program": "shirts_made_yesterday = 6 * 5\nshirts_made_today = 6 * 12\n# Follow up: how many shirts did machine make today?\nshirts_made_today = shirts_made_yesterday + shirts_made_today\nans = shirts_made_today", "gold_ans": "72", "Ans": 102.0}
{"question": "Rachel had to complete 7 pages of math homework. If she had to complete 4 more pages of math homework than reading homework How many pages of reading homework did she have to complete?", "program": "math_homework = 7\nreading_homework = x\n# Follow up: how many pages of reading homework did Rachel have to complete?\nreading_homework = math_homework + 4\nans= reading_homework", "gold_ans": "3", "Ans": 11.0}
